RailsDevise/app/controllers/gyms_controller.rb

SELECT "gyms".* FROM "gyms"
---
  def index
    @gyms = Gym.all

INSERT INTO "gyms" ("title", "company", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "FitnessD7"], ["company", "Fitness Dublin 7"], ["url", "www.fd7.com"], ["created_at", "2016-11-18 15:19:47.664971"], ["updated_at", "2016-11-18 15:19:47.664971"]]
---
  def create
    @gym = Gym.new(gym_params)

    respond_to do |format|
      if @gym.save

SELECT  "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_gym
      @gym = Gym.find(params[:id])